app/controllers/donations_controller.rb

    def index
        donations = Donation.all
        render json: Species.with_donations.map{|s| {:name => s.name, :total => s.total_donations}}
---
SELECT "species".* FROM "species"
SELECT COUNT(*) FROM "donations" WHERE "donations"."species_id" = ?  [["species_id", 1]]
SELECT "donations".* FROM "donations"

    def create
        donation = Donation.create(donation_params)
---
INSERT INTO "donations" ("user_id", "species_id", "created_at", "updated_at", "amount") VALUES (?, ?, ?, ?, ?)  [["user_id", 9], ["species_id", 1], ["created_at", "2021-01-29 00:17:00.992418"], ["updated_at", "2021-01-29 00:17:00.992418"], ["amount", 20]]