app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "ihposey"], ["email", "ihposey@crimson.ua.edu"], ["created_at", "2021-01-28 02:02:19.593372"], ["updated_at", "2021-01-28 02:02:19.593372"]]
---
    def create
        user = User.find_or_create_by(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "ihposey"], ["email", "jeffwposey@aol.com"], ["description", "super scary"], ["updated_at", "2021-01-28 18:03:26.227108"], ["id", 65]]
---
    def update
        user = User.find(params[:id])
        user.update(user_params)