app/models/species.rb

    def total_donations
        self.donations.map{|d| d.amount}.sum
---
SELECT "donations".* FROM "donations" WHERE "donations"."species_id" = ?  [["species_id", 2]]

    def self.with_donations
        self.all.select{|s| s.donations.size > 0}
---
SELECT "species".* FROM "species"
SELECT COUNT(*) FROM "donations" WHERE "donations"."species_id" = ?  [["species_id", 2]]